package Programmers.Level2;
/*
재귀문제란다..
*/
public class 워드압축후개수세기 {
  public static void main(String[] args) {
    //int[][] arr = {{1,1,0,0},{1,0,0,0},{1,0,0,1},{1,1,1,1}};
    int[][] arr = {{1,1,1,1,1,1,1,1},{1,1,1,1,1,1,1,1},{0,0,0,0,1,1,1,1},{0,1,0,0,1,1,1,1},{0,0,0,0,0,0,1,1},{0,0,0,0,0,0,0,1},{0,0,0,0,1,0,0,1},{0,0,0,0,1,1,1,1}};

    int n = arr.length;
    int compressCnt = 0; // 총 상자를 압축해야 하는 횟수 (단계)
    while (n > 1) {
      n /= 2;
      compressCnt++;
    }
    //(0, 0), (4, 0), (0, 4), (4, 4)

  }
}
